---
kind: property
id: P:Autodesk.Revit.DB.Macros.MacroManager.Folder
source: html/8d2294e3-1ca6-7e18-7330-5d32a0ad9690.htm
---
# Autodesk.Revit.DB.Macros.MacroManager.Folder Property

The modules folder.
 The path for document macros will not persist except while the document is loaded in this session.

## Syntax (C#)
```csharp
public string Folder { get; }
```